ab1/resumo.org
Resumo de compiladores

* Interpretação Pura
  Uma interpretação pura em compiladores é feita da seguinte maneira:
  dado o programa fonte, o programa fonte passará por um
  interpretador. Esse *interpretador* irá interpretar o código fonte a
  partir de dados de entrada e bibliotecas, gerando assim os
  resuldados.

** Benefícios
   - Os erros são mais fácies de serem detectados
   - Além de testar pedaços de códigos

** Desvantagens
   - A execução é mais lenta

* Compilação para bytecode
  O uso de compilação para geração de bytecode faz com que o programa
  fonte passe pelas seguintes partes:

** Analisador léxico
   O analisador léxico verifica se os elementos presentes no código
   fonte são válidos na linguagem. O seu papel é segmentar o programa
   e verificar a validade de cada segmento de código. A saída do
   analisador léxico são tokens. Tokens possuem um lexema, que nada
   mais é do que a classificação do token, linha, coluna e valor do
   token, que nada mais é do que o conteúdo em si.

** Analisador sintático
   Tem como saída uma árvore de derivações. Esse analisador tem como
   objetivo requisitar tokens do analisador léxico e a partir desses
   tokens fazer uma análise sintática do programa fonte. A medida que
   a análise sintática é feita, o analisador vai montando a árvore de
   derivação. Existem vários tipos de analisadores sintáticos.

** Analisador semântico
   A partir da ávore de derivação criada pelo analisador sintático, o
   analisador semântico avalia a compatibilidade dos nós e folhas
   dessa árvore. Ou seja, é no analisador semântico que a verificação
   dos tipos é efetuada, vendo assim se o programa fonte faz sentido
   segundo as especificações da linguagem.

** Gerador de bytecode
   Esse processo não é coberto pela disciplina.

** Tabela de símbolos
   Estabelece uma comunicação entre fases(citadas acima) diferentes do
   compilador. Geralmente na tabela de símbolos temos informações a
   respeito de variávies, funções/procedimentos e parâmetros.
* Análise Léxica(Scanner)
  Lê o código fonte e o separa em lexemas(unidades
  léxicas). Identifica os lexemas, categorizando-os e guardando suas
  posições. Elimina comentários.

  Lexemas serão palavras reservadas ou não. De modo geral os lexemas
  podem ser :
   - Identificadores
   - Constantes
   - Operadores
   - Separadores
   - Palavras reservadas
   
  Para fazer a identificação de cada um desses tipos, pode-se usar:
  - Expressões regulares
  - Gramática regular
  - Autômato finito determinístico
  - Autômato finito não-determinístico

 O alfabeto léxico se trata dos caracteres permitidos no código fonte,
 enquanto o alfabeto sintático se refere aos tokens possíveis.
   
* Análise sintática(Parser)
  É a segunda fase de um compilador. Atua sobre uma GLC, dado o
  programa fonte e seus respectivos tokens, produz-se uma árvore de
  derivação que reflete a estrutura sintática da sentença.

  Existem algumas estratégias de análise:
  - Top-down  ou descendente
    - Backtracking
    - Preditiva recursiva
    - Preditiva tabular
  - Bottom-up ou ascendente(redutiva, empilha-reduz)
    - Precedência de operadores
    - SLR(Simple left to right rightmost)


* Análise Top-Down
  A análise se inicia pela raiz da árvore através de
  derivação. Produções ao invés de erivações são escolhidas com base
  na entrada.

** Análise com Backtracking
  A cada derivação com mais de uma opção, cria-se um checkpoint que
  permite retorno em caso de erro

*** Desvantagens
    - É difícil encontrar a causa do erro
    - Ineficiente
*** Vantagens
    - É capaz de analisar qualquer tipo de gramática tratável

** Análise recursiva preditiva
  A gramática não pode ter recursões à esquerda. Logo ela deve ser:
  - Fatorada
  - Primeiros terminais deriváveis de produções de um mesmo
    não-terminal não podem ter intersecções

*** Características
    - Fácil de implementar
    - Muito código
    - Permite tratar repetições e opcionalidades

  Nesse tipo de analisador, o código é tratado sintáticamente da
  esquerda para a direita, onde para cada símbolo não terminal existe
  uma função que trata esse símbolo.

** Análise preditiva tabular(não recursiva)
   Para esse tipo de análise a gramática também deve ser fatorada e os
   primeiros temrinais deriváveis de um mesmo não-terminal não podem
   ter intersecções.
*** Funcionamento
    1. Inicia-se o processamento lendo o primeiro token e com o
       símbolo inicial na pilha.
    2. Se entrada for EOF e a pilha estiver vazia a sentença é aceita.
    3. Se token na entrada corresponder ao terminal no topo da pilha,
       o token foi reconhecido, acessa-se o próximo token e
       desempilha-se o terminal
    4. Topo da pilha não-terminal, indexa-se a tabela de análise pelo
       mesmo e pelo token na entrada, se a casa indexada estiver vazia
       é um erro sintático, caso contrário, efetua-se a derivação indicada.
       1. Desempilha-se o não-terminal e empilha o lado direito da
          produção na ordem inversa.


