estudo-prova-ab1/resumo.tex
% Created 2019-07-20 sáb 00:43
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Lucas Peixoto}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Lucas Peixoto},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

Resumo de compiladores

\section{Interpretação Pura}
\label{sec:orgc448c15}
Uma interpretação pura em compiladores é feita da seguinte maneira:
dado o programa fonte, o programa fonte passará por um
interpretador. Esse \textbf{interpretador} irá interpretar o código fonte a
partir de dados de entrada e bibliotecas, gerando assim os
resuldados.

\subsection{Benefícios}
\label{sec:org6c057c9}
\begin{itemize}
\item Os erros são mais fácies de serem detectados
\item Além de testar pedaços de códigos
\end{itemize}

\subsection{Desvantagens}
\label{sec:org023f03b}
\begin{itemize}
\item A execução é mais lenta
\end{itemize}

\section{Compilação para bytecode}
\label{sec:org954d377}
O uso de compilação para geração de bytecode faz com que o programa
fonte passe pelas seguintes partes:

\subsection{Analisador léxico}
\label{sec:org650e104}
O analisador léxico verifica se os elementos presentes no código
fonte são válidos na linguagem. O seu papel é segmentar o programa
e verificar a validade de cada segmento de código. A saída do
analisador léxico são tokens. Tokens possuem um lexema, que nada
mais é do que a classificação do token, linha, coluna e valor do
token, que nada mais é do que o conteúdo em si.

\subsection{Analisador sintático}
\label{sec:org963d3a3}
Tem como saída uma árvore de derivações. Esse analisador tem como
objetivo requisitar tokens do analisador léxico e a partir desses
tokens fazer uma análise sintática do programa fonte. A medida que
a análise sintática é feita, o analisador vai montando a árvore de
derivação. Existem vários tipos de analisadores sintáticos.

\subsection{Analisador semântico}
\label{sec:org357c967}
A partir da ávore de derivação criada pelo analisador sintático, o
analisador semântico avalia a compatibilidade dos nós e folhas
dessa árvore. Ou seja, é no analisador semântico que a verificação
dos tipos é efetuada, vendo assim se o programa fonte faz sentido
segundo as especificações da linguagem.

\subsection{Gerador de bytecode}
\label{sec:org457c11e}
Esse processo não é coberto pela disciplina.

\subsection{Tabela de símbolos}
\label{sec:orgae38d12}
Estabelece uma comunicação entre fases(citadas acima) diferentes do
compilador. Geralmente na tabela de símbolos temos informações a
respeito de variávies, funções/procedimentos e parâmetros.
\section{Análise Léxica(Scanner)}
\label{sec:orgbd0e223}
Lê o código fonte e o separa em lexemas(unidades
léxicas). Identifica os lexemas, categorizando-os e guardando suas
posições. Elimina comentários.

Lexemas serão palavras reservadas ou não. De modo geral os lexemas
podem ser :
\begin{itemize}
\item Identificadores
\item Constantes
\item Operadores
\item Separadores
\item Palavras reservadas
\end{itemize}

Para fazer a identificação de cada um desses tipos, pode-se usar:
\begin{itemize}
\item Expressões regulares
\item Gramática regular
\item Autômato finito determinístico
\item Autômato finito não-determinístico
\end{itemize}

O alfabeto léxico se trata dos caracteres permitidos no código fonte,
enquanto o alfabeto sintático se refere aos tokens possíveis.

\section{Análise sintática(Parser)}
\label{sec:orgfe88b1a}
É a segunda fase de um compilador. Atua sobre uma GLC, dado o
programa fonte e seus respectivos tokens, produz-se uma árvore de
derivação que reflete a estrutura sintática da sentença.

Existem algumas estratégias de análise:
\begin{itemize}
\item Top-down  ou descendente
\begin{itemize}
\item Backtracking
\item Preditiva recursiva
\item Preditiva tabular
\end{itemize}
\item Bottom-up ou ascendente(redutiva, empilha-reduz)
\begin{itemize}
\item Precedência de operadores
\item SLR(Simple left to right rightmost)
\end{itemize}
\end{itemize}


\section{Análise Top-Down}
\label{sec:org64cfc39}
A análise se inicia pela raiz da árvore através de
derivação. Produções ao invés de erivações são escolhidas com base
na entrada.

\subsection{Análise com Backtracking}
\label{sec:orgd311655}
A cada derivação com mais de uma opção, cria-se um checkpoint que
permite retorno em caso de erro

\subsubsection{Desvantagens}
\label{sec:org9153f67}
\begin{itemize}
\item É difícil encontrar a causa do erro
\item Ineficiente
\end{itemize}
\subsubsection{Vantagens}
\label{sec:orgdef5e7d}
\begin{itemize}
\item É capaz de analisar qualquer tipo de gramática tratável
\end{itemize}

\subsection{Análise recursiva preditiva}
\label{sec:org7674257}
A gramática não pode ter recursões à esquerda. Logo ela deve ser:
\begin{itemize}
\item Fatorada
\item Primeiros terminais deriváveis de produções de um mesmo
não-terminal não podem ter intersecções
\end{itemize}

\subsubsection{Características}
\label{sec:org7ca3028}
\begin{itemize}
\item Fácil de implementar
\item Muito código
\item Permite tratar repetições e opcionalidades
\end{itemize}

Nesse tipo de analisador, o código é tratado sintáticamente da
esquerda para a direita, onde para cada símbolo não terminal existe
uma função que trata esse símbolo.

\subsection{Análise preditiva tabular(não recursiva)}
\label{sec:org316093c}
Para esse tipo de análise a gramática também deve ser fatorada e os
primeiros temrinais deriváveis de um mesmo não-terminal não podem
ter intersecções.
\subsubsection{Funcionamento}
\label{sec:org4b56726}
\begin{enumerate}
\item Inicia-se o processamento lendo o primeiro token e com o
símbolo inicial na pilha.
\item Se entrada for EOF e a pilha estiver vazia a sentença é aceita.
\item Se token na entrada corresponder ao terminal no topo da pilha,
o token foi reconhecido, acessa-se o próximo token e
desempilha-se o terminal
\item Topo da pilha não-terminal, indexa-se a tabela de análise pelo
mesmo e pelo token na entrada, se a casa indexada estiver vazia
é um erro sintático, caso contrário, efetua-se a derivação indicada.
\begin{enumerate}
\item Desempilha-se o não-terminal e empilha o lado direito da
produção na ordem inversa.
\end{enumerate}
\end{enumerate}
