ab1/resumo.org
*** Exemplo:
    - Gramática\\
      (1) Eb = Tb Ebr\\
      (2) Ebr = 'ou' Tb Ebr\\
      (3) Ebr = Vazio\\
      (4) Tb = Fb Tbr\\
      (5) Tbr = 'e' Fb Tbr\\
      (6) Tbr = Vazio\\
      (7) Fb = 'não' Fb\\
      (8) Fb = '(' Eb ')'\\
      (9) Fb = 'id'\\
      (10) Fb = 'verd'\\
      (11) Fb = 'falso'\\

    - Tabela de análise com recuperação de erro local\\

      Apenas uma modificação é feita:
      - Desempilha um símbolo
      - Empilha um símbolo
      - Introduz um terminal na entrada
      - Trocar terminal da entrada\\

      Tabela:
      - é adicionada uma linha para os terminais que apareçam 
        fora da 1° posição em algum handle.
      - Expande as produções vazias para posições em branco na mesma
        linha (porterga a identificação de erro)\\

      Tipos de erros encontrados no exemplo:
      - Err1:
        - Msg: "Operando esperado"
        - Ação: "Insere "id" na entrada"
      - Err2:
        - Msg: " ')' esperado"
        - Ação: Desempilha ')'
      - Err3:
        - Msg: "EOF esperado"
        - Ação: Elimina a lista restante da entrada

|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
|                       | 'ou'  | 'e'   | 'nao' | '('   | ')'   | 'id'  | 'verd' | 'falso' | EOF   |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
| /                     | <     |       |       |       |       |       |        |         | >     |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
| Eb                    | Err1  | Err2  | d1    | d1    | Err1  | d1    | d1     | d1      | Err1  |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
| Ebr                   | d2    | Vazio | Vazio | Vazio | Vazio | Vazio | vazio  | Vazaio  | Vazio |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
| Tb                    | Err1  | Err1  | d4    | d4    | Err1  | d4    | d4     | d4      | Err1  |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
| Tbr                   | Vazio | d5    | Vazio | Vazio | Vazio | Vazio | Vazio  | Vazio   | Vazio |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
| Fb                    | Err1  | Err1  | d7    | d8    | Err1  | d9    | d10    | d11     | Err1  |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
| ')'                   | Err2  | Err2  | Err2  | Err2  | DAT   | Err2  | Err2   | Err2    | Err2  |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|
| PV                    | Err3  | Err3  | Err3  | Err3  | Err3  | Err3  | Err3   | Err3    | AC    |
|-----------------------+-------+-------+-------+-------+-------+-------+--------+---------+-------|


    - Tabela de análise com recuperação de erro pânico\\
      É necessário identificar os tokens de sincronização. Para cada
      não terminal temos que o token sync desse não terminal é dado
      pelo follow dele.

      Tratamento:
      - Mensagem de erro
      - EOF na entrada: encerra a análise
      - Pilha:
        - Terminal:
          - Despreza tokens na entrada enquanto terminal da pilha
            for diferente do token de entrada
          - Se terminal corresponder ao token de entrada continua a
            análise
        - Não-terminal
          - Despreza tokens na entrada enquanto entrada não
            corresponder a um terminal de sincronização
          - Quando corresponder: desempilha o não terminal e continua
            a análise

|-----------------------+------+------+-------+-----+------+------+--------+---------+------|
|                       | 'ou' | 'e'  | 'nao' | '(' | ')'  | 'id' | 'verd' | 'falso' | EOF  |
|-----------------------+------+------+-------+-----+------+------+--------+---------+------|
| /                     |   <  |      |       |     |      |      |        |         |   >  |
|-----------------------+------+------+-------+-----+------+------+--------+---------+------|
| Eb                    | -    | -    | d1    | d1  | Sync | d1   | d1     | d1      | Sync |
|-----------------------+------+------+-------+-----+------+------+--------+---------+------|
| Ebr                   | d2   | -    | -     | -   | -    | -    | -      | -       | -    |
|-----------------------+------+------+-------+-----+------+------+--------+---------+------|
| Tb                    | -    | -    | d4    | d4  | Sync | d4   | d4     | d4      | Sync |
|-----------------------+------+------+-------+-----+------+------+--------+---------+------|
| Tbr                   | -    | d5   | -     | -   | -    | -    | -      | -       | -    |
|-----------------------+------+------+-------+-----+------+------+--------+---------+------|
| Fb                    | Sync | Sync | d7    | d8  | Sync | d9   | d10    | d11     | Sync |
|-----------------------+------+------+-------+-----+------+------+--------+---------+------|

* Análise bottom-up
  - Redutiva
  - Empilha/reduz
  - A partir das folhas da árvore
  - Inicia com a pilha vazia 
  - Empilha símbolos até que na pilha estejam símbolos que
    correspondam ao lado direito de uma produção (*handle*)
  - Este *handle* é desempilhado e em seu lugar é empilhado o símbolo
    do lado esquerdo da produção(redução)
  - São empilhados tokens ou símbolos não terminais quando ocorre uma
    redução 
  - A produção a ser usada só é conhecida no momento da redução
  - Aceita quando na pilher tiver o símbolo inicial da GLC e na
    entrada EOF
  - Se a gramática for não ambigua, então toda forma sentencial gerada
    por G tem exatamente um handle.
** Analisadores
   - Ações:
     - Empilha (EAT): empilha o token na entrada e acessa o próximo
       token
     - Reduz(ri): substitui o handle da produção (i) pelo terminal à
       esquerda nesta produção
     - Aceita(Ac): reconhece a sentença quando na pilha tem o símbolo
       inicial e EOF na entrada
     - Erro: demais casos
   - Tipos de analizadores:
     - Precedência de operadores: bom para reconhecimento de
       expressões
     - LR:
       - SLR: Simple LR (só veremos esse)
       - LALR: Look Ahead LR
       - LR canônico
** Analisador de precedência de operadores
   - Gramática de operadores
   - Gramática simplificada 
   - Não pode ter dois não terminais adjascentes
   - Não podem ter produções vazias
   - Não ode ter um operador com aridades diferentes
   - A gramática não tem informações de rpecedência e associatividade
     - esta informação deve ser colocada na tabela de análise
   - Tabela de análise:
     - Tokens na pilha x tokens na entrada, PST(pilha sem token)
     - entrada(colunas): tokens e EOF
     - PST pode estar vazia (PV) ou não ter um não terminal
*** Relação entre tokens + ao topo topo/PST e a entrada(tokens ou EOF)
    - Prioridade calculada em relação da precedência e da
      associatividade
    - Se token na pilha tem prioridade:
      - maior: reduz
      - menor: empilha entrada
      - igual: empilha entrada
    - APO não garante validade do handle
    - Na redução os elementos da pilha devem ser testados para
      garantir esta validade
      - Caso isso não ocorra, temos um erro na redução chamado de erro
        mais tarde
    - Erros identificados durante a análise, especificados na tabela
      de análise, são ditos erros mais cedo
