estudo-prova-ab1/resumo.tex


\subsubsection{Exemplo:}
\label{sec:orga4f6518}
\begin{itemize}
\item Gramática\\
(1) Eb = Tb Ebr\\
(2) Ebr = 'ou' Tb Ebr\\
(3) Ebr = Vazio\\
(4) Tb = Fb Tbr\\
(5) Tbr = 'e' Fb Tbr\\
(6) Tbr = Vazio\\
(7) Fb = 'não' Fb\\
(8) Fb = '(' Eb ')'\\
(9) Fb = 'id'\\
(10) Fb = 'verd'\\
(11) Fb = 'falso'\\

\item Tabela de análise com recuperação de erro local\\

Apenas uma modificação é feita:
\begin{itemize}
\item Desempilha um símbolo
\item Empilha um símbolo
\item Introduz um terminal na entrada
\item Trocar terminal da entrada\\
\end{itemize}

Tabela:
\begin{itemize}
\item é adicionada uma linha para os terminais que apareçam 
fora da 1° posição em algum handle.
\item Expande as produções vazias para posições em branco na mesma
linha (porterga a identificação de erro)\\
\end{itemize}

Tipos de erros encontrados no exemplo:
\begin{itemize}
\item Err1:
\begin{itemize}
\item Msg: "Operando esperado"
\item Ação: "Insere "id" na entrada"
\end{itemize}
\item Err2:
\begin{itemize}
\item Msg: " ')' esperado"
\item Ação: Desempilha ')'
\end{itemize}
\item Err3:
\begin{itemize}
\item Msg: "EOF esperado"
\item Ação: Elimina a lista restante da entrada
\end{itemize}
\end{itemize}
\end{itemize}

\begin{center}
\begin{tabular}{l|lllllllll|}
\hline
 & 'ou' & 'e' & 'nao' & '(' & ')' & 'id' & 'verd' & 'falso' & EOF\\
\hline
\hline
Eb & Err1 & Err2 & d1 & d1 & Err1 & d1 & d1 & d1 & Err1\\
\hline
Ebr & d2 & Vazio & Vazio & Vazio & Vazio-d3 & Vazio & vazio & Vazaio & Vazio-d3\\
\hline
Tb & Err1 & Err1 & d4 & d4 & Err1 & d4 & d4 & d4 & Err1\\
\hline
Tbr & Vazio-d6 & d5 & Vazio & Vazio & Vazio-d6 & Vazio & Vazio & Vazio & Vazio-d6\\
\hline
Fb & Err1 & Err1 & d7 & d8 & Err1 & d9 & d10 & d11 & Err1\\
\hline
')' & Err2 & Err2 & Err2 & Err2 & DAT & Err2 & Err2 & Err2 & Err2\\
\hline
PV & Err3 & Err3 & Err3 & Err3 & Err3 & Err3 & Err3 & Err3 & AC\\
\hline
\end{tabular}
\end{center}


\begin{itemize}
\item Tabela de análise com recuperação de erro pânico\\
É necessário identificar os tokens de sincronização. Para cada
não terminal temos que o token sync desse não terminal é dado
pelo follow dele.

Tratamento:
\begin{itemize}
\item Mensagem de erro
\item EOF na entrada: encerra a análise
\item Pilha:
\begin{itemize}
\item Terminal:
\begin{itemize}
\item Despreza tokens na entrada enquanto terminal da pilha
for diferente do token de entrada
\item Se terminal corresponder ao token de entrada continua a
análise
\end{itemize}
\item Não-terminal
\begin{itemize}
\item Despreza tokens na entrada enquanto entrada não
corresponder a um terminal de sincronização
\item Quando corresponder: desempilha o não terminal e continua
a análise
\end{itemize}
\end{itemize}
\end{itemize}
\end{itemize}

\begin{center}
\begin{tabular}{l|lllllllll|}
\hline
 & 'ou' & 'e' & 'nao' & '(' & ')' & 'id' & 'verd' & 'falso' & EOF\\
\hline
\hline
Eb & - & - & d1 & d1 & Sync & d1 & d1 & d1 & Sync\\
\hline
Ebr & d2 & - & - & - & Vazio-d3 & - & - & - & Vazio-d3\\
\hline
Tb & - & - & d4 & d4 & Sync & d4 & d4 & d4 & Sync\\
\hline
Tbr & Vazio-d6 & d5 & - & - & Vazio-d6 & - & - & - & Vazio-d6\\
\hline
Fb & Sync & Sync & d7 & d8 & Sync & d9 & d10 & d11 & Sync\\
\hline
\end{tabular}
\end{center}

\section{Análise bottom-up}
\label{sec:org018276e}
\begin{itemize}
\item Redutiva
\item Empilha/reduz
\item A partir das folhas da árvore
\item Inicia com a pilha vazia
\item Empilha símbolos até que na pilha estejam símbolos que
correspondam ao lado direito de uma produção (\textbf{handle})
\item Este \textbf{handle} é desempilhado e em seu lugar é empilhado o símbolo
do lado esquerdo da produção(redução)
\item São empilhados tokens ou símbolos não terminais quando ocorre uma
redução
\item A produção a ser usada só é conhecida no momento da redução
\item Aceita quando na pilher tiver o símbolo inicial da GLC e na
entrada EOF
\item Se a gramática for não ambigua, então toda forma sentencial gerada
por G tem exatamente um handle.
\end{itemize}
\subsection{Analisadores}
\label{sec:org8db703a}
\begin{itemize}
\item Ações:
\begin{itemize}
\item Empilha (EAT): empilha o token na entrada e acessa o próximo
token
\item Reduz(ri): substitui o handle da produção (i) pelo terminal à
esquerda nesta produção
\item Aceita(Ac): reconhece a sentença quando na pilha tem o símbolo
inicial e EOF na entrada
\item Erro: demais casos
\end{itemize}
\item Tipos de analizadores:
\begin{itemize}
\item Precedência de operadores: bom para reconhecimento de
expressões
\item LR:
\begin{itemize}
\item SLR: Simple LR (só veremos esse)
\item LALR: Look Ahead LR
\item LR canônico
\end{itemize}
\end{itemize}
\end{itemize}
\subsection{Analisador de precedência de operadores}
\label{sec:orgb286ed0}
\begin{itemize}
\item Gramática de operadores
\item Gramática simplificada
\item Não pode ter dois não terminais adjascentes
\item Não podem ter produções vazias
\item Não ode ter um operador com aridades diferentes
\item A gramática não tem informações de rpecedência e associatividade
\begin{itemize}
\item esta informação deve ser colocada na tabela de análise
\end{itemize}
\item Tabela de análise:
\begin{itemize}
\item Tokens na pilha x tokens na entrada, PST(pilha sem token)
\item entrada(colunas): tokens e EOF
\item PST pode estar vazia (PV) ou não ter um não terminal
\end{itemize}
\end{itemize}
\subsubsection{Relação entre tokens + ao topo topo/PST e a entrada(tokens ou EOF)}
\label{sec:org97c426e}
\begin{itemize}
\item Prioridade calculada em relação da precedência e da
associatividade
\item Se token na pilha tem prioridade:
\begin{itemize}
\item maior: reduz
\item menor: empilha entrada
\item igual: empilha entrada
\end{itemize}
\item APO não garante validade do handle
\item Na redução os elementos da pilha devem ser testados para
garantir esta validade
\begin{itemize}
\item Caso isso não ocorra, temos um erro na redução chamado de erro
mais tarde
\end{itemize}
\item Erros identificados durante a análise, especificados na tabela
de análise, são ditos erros mais cedo
\end{itemize}
