ab1/resumo.org
*** Exemplo
    - Gramática\\
      (1) Eb = Eb 'ou' Eb\\
      (2) ---- Eb 'e' Eb\\
      (3) ---- 'nao' Eb\\
      (4) ---- '(' Eb ')'\\
      (5) ---- 'id'\\
      (6) ---- 'verd'\\
      (7) ---- 'falso\\
    
    Tipos de erro mais cedo encontrados:
    - Err1:
      msg: ')' esperado
      ação: encerra análise
    - Err2:
      msg: operador binário esperado
      ação: insere um operador binário
    - Err3: ')' não esperado
      ação: remove ')' da entrada

    Erros mais tarde que podem ocorrer:
    - (1) e (2):\\
      Se topo != Eb\\
        msg: Segundo operando faltando\\
      senão desempilha Eb\\
      desempilha 'ou'/'e'\\
      se topo != Eb\\
        msg: Primeiro operando faltando\\
      senão desempilha Eb\\
      empilha novo Eb\\
    - (3): \\
      se topo != Eb
      msg: operando faltando
      senão desempilha Eb
      desempilha 'nao'
      empilha novo Eb
    - (4): \\
      desempilha ')'
      se topo != Eb
      msg: expressão booleana faltando
      senão desempilha Eb
      desempilha '('
      empilha novo Eb
    - (5), (6) e (7):
      não existe o erro porque nunca é empilhado nada sobre esses
      terminais.
                 

|---------+------+-----+-------+------+------+------+--------+---------+------|
|         | 'ou' | 'e' | 'nao' | '('  | ')'  | 'id' | 'verd' | 'falso' | EOF  |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| /       |  <   |     |       |      |      |      |        |         |   >  |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| 'ou'    | r1   | EAT | EAT   | EAT  | r1   | EAT  | EAT    | EAT     | r1   |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| 'e'     | r2   | r2  | EAT   | EAT  | r2   | EAT  | EAT    | EAT     | r2   |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| 'nao'   | r3   | r3  | EAT   | EAT  | r3   | EAT  | EAT    | EAT     | r3   |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| '('     | EAT  | EAT | EAT   | EAT  | EAT  | EAT  | EAT    | EAT     | Err1 |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| ')'     | r4   | r4  | Err2  | Err2 | r4   | Err2 | Err2   | Err2    | r4   |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| 'id'    | r5   | r5  | Err2  | Err2 | r5   | Err2 | Err2   | Err2    | r5   |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| 'verd'  | r6   | r6  | Err2  | Err2 | r6   | Err2 | Err2   | Err2    | r6   |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| 'falso' | r7   | r7  | Err2  | Err2 | r7   | Err2 | Err2   | Err2    | r7   |
|---------+------+-----+-------+------+------+------+--------+---------+------|
| PST     | EAT  | EAT | EAT   | EAT  | Err3 | EAT  | EAT    | EAT     | AC   |
|---------+------+-----+-------+------+------+------+--------+---------+------|

** Analisador SLR
   Conjunto canônico de itens SLR
   - Item Lr(0) em uma GLC marca uma posição no andamendo da análise
     marcada por um ponto.

*** Exemplo
    - Gramática\\
      (0) S = Eb\\
      (1) Eb = Eb 'ou' Tb\\
      (2) Eb = Tb\\
      (3) Tb = Tb 'e' Fb\\
      (4) Tb = Fb\\
      (5) Fb = 'nao' Fb\\
      (6) Fb = '(' Eb ')'\\
      (7) Fb = 'id'\\

    Fazendo o fechamento da gramática
    - 0 = {S = *.* Eb, Eb = *.* Eb 'ou' Tb, Eb = *.* Tb, Tb = *.* Tb
      'e' Fb, Tb = *.* Fb, Fb = *.* 'nao' Fb, Fb = *.* '(' Eb ')', Fb
      = *.* 'id'}
    - 1 = (0, Eb) = {S = Eb *.*, Eb = Eb *.* 'ou' Tb}
    - 2 = (0, Tb) = {Eb = Tb *.*, Tb = Tb *.* 'e' Fb}
    - 3 = (0, Fb) = {Tb = Fb *.*}
    - 4 = (0, 'nao') = { Fb = 'nao' *.* Fb, Fb = *.* 'nao' Fb, Fb =
      *.* '(' Eb ')', Fb = *.* 'id'}
    - 5 = (0, '(') = { Fb = '(' *.* Eb ')', Eb = *.* Eb 'ou' Tb, 
           Eb = *.* Tb, Tb = *.* Tb 'e' Fb, Tb = *.* Fb, 
           Fb = *.* 'nao' Fb, Fb = *.* '(' Eb ')', Fb = *.* 'id'}
    - 6 = (0, 'id') = { Fb = 'id' *.*}
    - 7 = (1, 'ou') = { Eb = Eb 'ou' *.* Tb, Tb = *.* Tb
      'e' Fb, Tb = *.* Fb, Fb = *.* 'nao' Fb, Fb = *.* '(' Eb ')', Fb
      = *.* 'id'}
    - 8 = (2, 'e') = { Tb = Tb 'e' *.* Fb, Fb = *.* 'nao' Fb,
                   Fb = *.* '(' Eb ')', Fb = *.* 'id'}
    - 9 = (4, Fb) = {Fb = 'nao' Fb *.*}
    -     (4, 'nao') = 4
    -     (4, '(') = 5
    -     (4, 'id') = 6
    - 10 = (5, Eb) = {Fb = '(' Eb *.* ')', Eb = Eb *.* 'ou' Tb}
    -      (5, Tb) = 2
    -      (5, Fb) = 3
    -      (5, 'nao') = 4
    -      (5,  '(') = 5
    -      (5, 'id') = 6
    - 11 = (7, Tb) = { Eb = Eb 'ou' Tb *.*, Tb = Tb *.* 'e' Fb }
    -      (7, Fb) = 3
    -      (7, '(') = 5
    -      (7, 'nao') = 4
    -      (7, 'id') = 6
    - 12 = (8, Fb) = { Tb = Tb 'e' Fb *.*}
    -      (8, 'nao') = 4
    -      (8, '(') = 5
    -      (8, 'id') = 6
    - 13 = (10, ')') = { Fb = '(' Eb ')' *.*}
    -      (10, 'ou') = 7
    -      (11, 'e') = 8

 
    
