estudo-prova-ab1/resumo.tex
\subsubsection{Exemplo}
\label{sec:org28e5308}
\begin{itemize}
\item Gramática\\
(1) Eb = Eb 'ou' Eb\\
(2) ---- Eb 'e' Eb\\
(3) ---- 'nao' Eb\\
(4) ---- '(' Eb ')'\\
(5) ---- 'id'\\
(6) ---- 'verd'\\
(7) ---- 'falso\\
\end{itemize}

Tipos de erro mais cedo encontrados:
\begin{itemize}
\item Err1:
msg: ')' esperado
ação: encerra análise
\item Err2:
msg: operador binário esperado
ação: insere um operador binário
\item Err3: ')' não esperado
ação: remove ')' da entrada
\end{itemize}

Erros mais tarde que podem ocorrer:
\begin{itemize}
\item (1) e (2):\\
Se topo != Eb\\
  msg: Segundo operando faltando\\
senão desempilha Eb\\
desempilha 'ou'/'e'\\
se topo != Eb\\
  msg: Primeiro operando faltando\\
senão desempilha Eb\\
empilha novo Eb\\
\item (3): \\
se topo != Eb
msg: operando faltando
senão desempilha Eb
desempilha 'nao'
empilha novo Eb
\item (4): \\
desempilha ')'
se topo != Eb
msg: expressão booleana faltando
senão desempilha Eb
desempilha '('
empilha novo Eb
\item (5), (6) e (7):
não existe o erro porque nunca é empilhado nada sobre esses
terminais.
\end{itemize}


\begin{center}
\begin{tabular}{l|lllllllll|}
\hline
 & 'ou' & 'e' & 'nao' & '(' & ')' & 'id' & 'verd' & 'falso' & EOF\\
\hline
\hline
'ou' & r1 & EAT & EAT & EAT & r1 & EAT & EAT & EAT & r1\\
\hline
'e' & r2 & r2 & EAT & EAT & r2 & EAT & EAT & EAT & r2\\
\hline
'nao' & r3 & r3 & EAT & EAT & r3 & EAT & EAT & EAT & r3\\
\hline
'(' & EAT & EAT & EAT & EAT & EAT & EAT & EAT & EAT & Err1\\
\hline
')' & r4 & r4 & Err2 & Err2 & r4 & Err2 & Err2 & Err2 & r4\\
\hline
'id' & r5 & r5 & Err2 & Err2 & r5 & Err2 & Err2 & Err2 & r5\\
\hline
'verd' & r6 & r6 & Err2 & Err2 & r6 & Err2 & Err2 & Err2 & r6\\
\hline
'falso' & r7 & r7 & Err2 & Err2 & r7 & Err2 & Err2 & Err2 & r7\\
\hline
PST & EAT & EAT & EAT & EAT & Err3 & EAT & EAT & EAT & AC\\
\hline
\end{tabular}
\end{center}

\subsection{Analisador SLR}
\label{sec:orgbd89409}
Conjunto canônico de itens SLR
\begin{itemize}
\item Item Lr(0) em uma GLC marca uma posição no andamendo da análise
marcada por um ponto.
\end{itemize}

\subsubsection{Exemplo}
\label{sec:org92cf842}
\begin{itemize}
\item Gramática\\
(0) S = Eb\\
(1) Eb = Eb 'ou' Tb\\
(2) Eb = Tb\\
(3) Tb = Tb 'e' Fb\\
(4) Tb = Fb\\
(5) Fb = 'nao' Fb\\
(6) Fb = '(' Eb ')'\\
(7) Fb = 'id'\\
\end{itemize}

Fazendo o fechamento da gramática
\begin{itemize}
\item 0 = \{S = \textbf{.} Eb, Eb = \textbf{.} Eb 'ou' Tb, Eb = \textbf{.} Tb, Tb = \textbf{.} Tb
'e' Fb, Tb = \textbf{.} Fb, Fb = \textbf{.} 'nao' Fb, Fb = \textbf{.} '(' Eb ')', Fb
= \textbf{.} 'id'\}
\item 1 = (0, Eb) = \{S = Eb \textbf{.}, Eb = Eb \textbf{.} 'ou' Tb\}
\item 2 = (0, Tb) = \{Eb = Tb \textbf{.}, Tb = Tb \textbf{.} 'e' Fb\}
\item 3 = (0, Fb) = \{Tb = Fb \textbf{.}\}
\item 4 = (0, 'nao') = \{ Fb = 'nao' \textbf{.} Fb, Fb = \textbf{.} 'nao' Fb, Fb =
\textbf{.} '(' Eb ')', Fb = \textbf{.} 'id'\}
\item 5 = (0, '(') = \{ Fb = '(' \textbf{.} Eb ')', Eb = \textbf{.} Eb 'ou' Tb, 
Eb = \textbf{.} Tb, Tb = \textbf{.} Tb 'e' Fb, Tb = \textbf{.} Fb, 
Fb = \textbf{.} 'nao' Fb, Fb = \textbf{.} '(' Eb ')', Fb = \textbf{.} 'id'\}
\item 6 = (0, 'id') = \{ Fb = 'id' \textbf{.}\}
\item 7 = (1, 'ou') = \{ Eb = Eb 'ou' \textbf{.} Tb, Tb = \textbf{.} Tb
'e' Fb, Tb = \textbf{.} Fb, Fb = \textbf{.} 'nao' Fb, Fb = \textbf{.} '(' Eb ')', Fb
= \textbf{.} 'id'\}
\item 8 = (2, 'e') = \{ Tb = Tb 'e' \textbf{.} Fb, Fb = \textbf{.} 'nao' Fb,
Fb = \textbf{.} '(' Eb ')', Fb = \textbf{.} 'id'\}
\item 9 = (4, Fb) = \{Fb = 'nao' Fb \textbf{.}\}
\item (4, 'nao') = 4
\item (4, '(') = 5
\item (4, 'id') = 6
\item 10 = (5, Eb) = \{Fb = '(' Eb \textbf{.} ')', Eb = Eb \textbf{.} 'ou' Tb\}
\item (5, Tb) = 2
\item (5, Fb) = 3
\item (5, 'nao') = 4
\item (5,  '(') = 5
\item (5, 'id') = 6
\item 11 = (7, Tb) = \{ Eb = Eb 'ou' Tb \textbf{.}, Tb = Tb \textbf{.} 'e' Fb \}
\item (7, Fb) = 3
\item (7, '(') = 5
\item (7, 'nao') = 4
\item (7, 'id') = 6
\item 12 = (8, Fb) = \{ Tb = Tb 'e' Fb \textbf{.}\}
\item (8, 'nao') = 4
\item (8, '(') = 5
\item (8, 'id') = 6
\item 13 = (10, ')') = \{ Fb = '(' Eb ')' \textbf{.}\}
\item (10, 'ou') = 7
\item (11, 'e') = 8
\end{itemize}
\end{document}